app/Controllers/Kas/KasController.php

UPDATE `tbl_uang_kas` SET `jumlah` = 300000
WHERE `tbl_uang_kas`.`id` IN (1)
---
    public function deleteAllTransaksi($jenis) // Menerima parameter jenis
    {
        // Pastikan jenis yang diterima valid
        if (!in_array($jenis, ['pemasukan', 'pengeluaran'])) {
            return redirect()->back()->with('error', 'Jenis transaksi tidak valid.');
        }

        // Ambil semua transaksi berdasarkan jenis
        $transaksiToDelete = $this->transaksiModel->where('jenis', $jenis)->findAll();

        if (empty($transaksiToDelete)) {
            return redirect()->back()->with('error', 'Tidak ada data transaksi ' . $jenis . ' yang ditemukan.');
        }

        // Hitung total jumlah untuk penyesuaian uang kas
        $totalJumlah = 0;
        foreach ($transaksiToDelete as $transaksi) {
            $totalJumlah += $transaksi['jumlah'];
        }

        // Ambil jumlah uang kas saat ini
        $uangKasSaatIni = $this->uangModel->first()['jumlah'];

        if ($jenis == 'pemasukan') {
            // Kurangi uang kas dengan total pemasukan yang dihapus
            $this->uangModel->update(1, [
                'jumlah' => $uangKasSaatIni - $totalJumlah
            ]);